---
kind: other
id: Methods.T:Autodesk.Revit.DB.LinkElementId
source: html/ce5fd576-da5f-d9f3-198d-268c9f93d456.htm
---
# LinkElementId Methods

Determines whether the specified Object is equal to the current Object .